smartdocApplication/app/controllers/docs_controller.rb

  def index
    @docs = Doc.all
---
SELECT "docs".* FROM "docs"

  def create
    @doc = Doc.new(doc_params)

    respond_to do |format|
      if @doc.save
---
INSERT INTO "docs" ("patient", "date", "time", "details", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["patient", "Caroline"], ["date", "2018-04-22"], ["time", "2000-01-01 01:09:00"], ["details", "knel"], ["created_at", "2018-04-22 01:09:54.449678"], ["updated_at", "2018-04-22 01:09:54.449678"]]

  def update
    respond_to do |format|
      if @doc.update(doc_params)
---
UPDATE "docs" SET "patient" = ?, "details" = ?, "updated_at" = ? WHERE "docs"."id" = ?  [["patient", "Paul Brady"], ["details", "Renew perscription"], ["updated_at", "2018-04-22 17:54:18.790406"], ["id", 3]]

  def destroy
    @doc.destroy
---
DELETE FROM "docs" WHERE "docs"."id" = ?  [["id", 2]]

    def set_doc
      @doc = Doc.find(params[:id])
---
SELECT  "docs".* FROM "docs" WHERE "docs"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]