smartdocApplication/app/controllers/notes_controller.rb

SELECT  "patients".* FROM "patients" WHERE "patients"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def index
# For URL like /patients/1/notes
# Get the patient with id=1
  @patient = Patient.find(params[:patient_id])

SELECT  "patients".* FROM "patients" WHERE "patients"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "notes".* FROM "notes" WHERE "notes"."patient_id" = ? AND "notes"."id" = ? LIMIT ?  [["patient_id", 1], ["id", 1], ["LIMIT", 1]]
---
  def show
  @patient = Patient.find(params[:patient_id])
# For URL like /patient/1/notes/2
# Find an note  in patients 1 that has id=2
  @notes = @patient.notes.find(params[:id])

SELECT  "patients".* FROM "patients" WHERE "patients"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def new
  @patient = Patient.find(params[:patient_id])

SELECT  "patients".* FROM "patients" WHERE "patients"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "notes" ("details", "patient_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["details", "kndk"], ["patient_id", 1], ["created_at", "2018-04-06 18:07:01.184660"], ["updated_at", "2018-04-06 18:07:01.184660"]]
---
  def create
  @patient = Patient.find(params[:patient_id])
# For URL like /movies/1/reviews
# Populate an review associate with movie 1 with form data
# Movie will be associated with the review
#  @review = @movie.reviews.build(params.require(:review).permit!)
  @note = @patient.notes.build(params.require(:note).permit(:details))
  if @note.save

SELECT  "patients".* FROM "patients" WHERE "patients"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "notes".* FROM "notes" WHERE "notes"."patient_id" = ? AND "notes"."id" = ? LIMIT ?  [["patient_id", 1], ["id", 1], ["LIMIT", 1]]
---
  def edit
  @patient = Patient.find(params[:patient_id])
# For URL like /movies/1/reviews/2/edit
# Get review id=2 for movie 1
  @note = @patient.notes.find(params[:id])

SELECT  "patients".* FROM "patients" WHERE "patients"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "notes" SET "details" = ?, "updated_at" = ? WHERE "notes"."id" = ?  [["details", "g"], ["updated_at", "2018-04-06 18:28:21.189234"], ["id", 1]]
---
  def update
  @patient = Patient.find(params[:patient_id])
  @note = Note.find(params[:id])
  if
  @note.update_attributes(params.require(:note).permit(:details))

SELECT  "patients".* FROM "patients" WHERE "patients"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "notes" WHERE "notes"."id" = ?  [["id", 1]]
---
  def destroy
  @patient = Patient.find(params[:patient_id])
  @note = Note.find(params[:id])
  @note.destroy