smartdocApplication/app/controllers/patients_controller.rb

  def index
    @patients = Patient.all
---
SELECT "patients".* FROM "patients" WHERE (name LIKE '%nlkpoj%')

  def create
    @patient = Patient.new(patient_params)

    respond_to do |format|
      if @patient.save
---
INSERT INTO "patients" ("name", "contact", "date_of_birth", "address", "injury", "action", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @patient.update(patient_params)
---
UPDATE "patients" SET "name" = ?, "contact" = ?, "updated_at" = ? WHERE "patients"."id" = ?  [["name", "James O'Connell"], ["contact", "083439988"], ["updated_at", "2018-04-19 12:53:26.972694"], ["id", 1]]

  def destroy

    @patient.destroy
---
DELETE FROM "patients" WHERE "patients"."id" = ?  [["id", 1]]