smartdocApplication/app/views/notes/show.html.erb

<h2>Notes</h2>
<% @patient.notes.each do |note| %>
---
SELECT  "notes".* FROM "notes" WHERE "notes"."patient_id" = ? AND "notes"."id" = ? LIMIT ?  [["patient_id", 1], ["id", 1], ["LIMIT", 1]]